Enums/ГруппыВычетовПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ГруппыВычетовПоНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартныеНаДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущественные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Социальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальныеПоУведомлениюНО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СправкиПоНДФЛПовтИсп/Ext/Module.bsl
Функция КодыДоходовПоЦеннымБумагам(НалоговыйПериод) Экспорт
	
	СтрокаКодовДоходовПоЦеннымБумагам = "1010,1110,1120,1530,1531,1532,1533,1535,1536,1537,1538,1539,1540,1541,1543,1544,1545,1546,1547,1548,1549,1551,1552,1553,1554,2640,2641,2800";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ДоходыНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	ВидыДоходовНДФЛ.КодДляОтчетности В(&КодыДоходов)";
	Запрос.УстановитьПараметр("КодыДоходов", СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКодовДоходовПоЦеннымБумагам));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")
	
КонецФункции

Функция СвойстваВычета(КодВычета) Экспорт

	СтруктураСвойствВычета = ОбщегоНазначенияЗК.ПолучитьЗначенияРеквизитов(КодВычета, "ГруппаВычета, КодДляОтчетности2015, КодДляОтчетности2016");
    СтруктураСвойствВычета.Вставить("ЭтоИмущественныйВычет", СтруктураСвойствВычета.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные);
    СтруктураСвойствВычета.Вставить("ЭтоСоциальныйВычетПоУведомлениюНО", СтруктураСвойствВычета.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО);
    СтруктураСвойствВычета.Вставить("ПредоставляетсяПоУведомлениюНО", СтруктураСвойствВычета.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные Или СтруктураСвойствВычета.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО);
	СтруктураСвойствВычета.Вставить("ТекущийКод", СтруктураСвойствВычета.КодДляОтчетности2016);
	
	Возврат СтруктураСвойствВычета
	
КонецФункции
